powerlaw_circularcavity3D/Newtonian/Ra2e4/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             Newtonian;

                rho             rho [1 -3 0 0 0 0 0] 1;
                eta             eta [1 -1 -1 0 0 0 0] 7;
  
      //           etaMin          etaMin [1 -1 -1 0 0 0 0] 0; 
      //   etaMax          etaMax [1 -1 -1 0 0 0 0] 1e4; 
      // k               k [1 -1 -1 0 0 0 0] 1; 
      // n               n [ 0 0 0 0 0 0 0 ] 0.6;
                         
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
