powerlaw_circularcavity3D/Newtonian/Ra2e4/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type           fixedValue;
        value          uniform  0;     
    }
    
    bottom
    {
        type           fixedValue;
        value          uniform  1;
    }
    
    "(wall|frontAndBack)"
    {
        type           zeroGradient;
    }
    
}

// ************************************************************************* //
